<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>VirtualBOSS HELP: modulo_FIN_NFREPORT</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author"		 content="Alessander Oliveira">
<meta name="Description" content="VirtualBOSS - application help for MODULO_USUARIO"></head>
<body bgcolor="#FFFFFF" style="font-family:Tahoma; size:10px; color:#666666; line-height:25px; vertical-align:top;">
<table style="width:100%; border:0px; background:#FFFFFF; text-align:left;" cellpadding="0" cellspacing="0">

  <tr><td height="30" colspan="2" bgcolor="#EDF2F6" style="vertical-align:middle">&nbsp;VirtualBOSS.<b>modulo_FIN_NFREPORT</b></td></tr>	
  <tr><td height="40" colspan="2"></td></tr>	

  <tr>
    <td colspan="2" valign="top">
      Módulo destinado por hora a emisão de relatório de notas fiscais em formato listagem. <br />
      <br />
    </td>
  </tr>

  <tr><td colspan="2" height="40"></td></tr>	
  <tr><td colspan="2" valign="top"><b>Grupos de usuários:</b></td></tr>
  <tr><td colspan="2" height="40"></td></tr>	

  <tr>
    <td width="20" valign="top" bgcolor="#FF8000"></td>
    <td valign="top" style="padding-left:10px;">
	 As definições e regras para sua futura utilização mais avançada serão definidas em breve
    <br /></td>
  </tr>

  <tr><td colspan="2" height="40"></td></tr>	
  <tr><td colspan="2" valign="top"><b>Permissões de acesso (direitos):</b></td></tr>
  <tr><td colspan="2" height="40"></td></tr>	

  <tr>
    <td width="20" valign="top" bgcolor="#0099FF"></td>
    <td valign="top" style="padding-left:10px;">
          <b>Conceito de Aplicação/Módulo</b>
		  <br />
		  <br />
          Considerando a palavra &quot;Aplica&ccedil;&atilde;o&quot; como sin&ocirc;nima de &quot;M&oacute;dulo&quot;: onde determinado grupo de a&ccedil;&otilde;es sobre uma entidade, conjunto de tabelas ou qualquer abstra&ccedil;&atilde;o de cadastros pode ser realizada, temos neste sistema diversos m&oacute;dulos acess&iacute;veis aos usu&aacute;rios cadastrados no sistema, relacionando estas a&ccedil;&otilde;es com permiss&otilde;es de opera&ccedil;&atilde;o e acesso as mesmas que podem ser configuradas neste nesta aplica&ccedil;&atilde;o corrente, para cada usu&aacute;rio.<br />
          <br />
		  Cada m&oacute;dulo possui um conjunto de a&ccedil;&otilde;es que s&atilde;o pass&iacute;veis de se registrar um direito de execu&ccedil;&atilde;o sobre ela para cada usu&aacute;rio cadastrado, onde podemos resumir o conceito em 
		  A&ccedil;&otilde;es  e Direitos, onde:
		  <br />
		  <br />
          <div style="background-color:#E9E9E9; width:90%; height:30px; padding:10px 10px 10px 10px;">&quot;a&ccedil;&atilde;o&quot; &eacute; uma opera&ccedil;&atilde;o da aplica&ccedil;&atilde;o e &quot;direito&quot; &eacute; a permiss&atilde;o de executar uma determinada a&ccedil;&atilde;o.</div>
          <p><br />
            <b>A aplica&ccedil;&atilde;o e suas a&ccedil;&otilde;es</b><br />
		    <br />
		    Uma aplica&ccedil;&atilde;o (m&oacute;dulo) possui opera&ccedil;&otilde;es que s&atilde;o pass&iacute;veis de controle de permiss&otilde;es, exemplo: este m&oacute;dulo de NF REPORT possui somente a opera&ccedil;&atilde;o de <strong>VIEW</strong> (Visualiza&ccedil;&atilde;o).          </p></td>
  </tr>


  <tr><td colspan="2" height="40"></td></tr>	
  <tr>
    <td colspan="2" valign="top"><b>CAMPOS, &quot;REGRA de NEG&Oacute;CIO&quot; e FEATURES </b></td>
  </tr>
  <tr><td colspan="2" height="40"></td></tr>	

  <tr>
    <td width="20" valign="top" bgcolor="#009966"></td>
    <td valign="top" style="padding-left:10px;">
      <p>Dentre os campos existentes para o cadastro ao qual este m&oacute;dulo trabalha, destacamos abaixo apenas os de especial relev&acirc;ncia, com rela&ccedil;&atilde;o a alguma &quot;regra de neg&oacute;cio&quot; ao qual tal campo se relacione, a saber:<br />
        <br />
        <b>N. NF</b><strong>:</strong> Refere-se ao n&uacute;mero da nota fiscal.<br />
       <strong>DT Emiss&atilde;o:</strong> Este campo mostra a data de emiss&atilde;o do documento.<br />
       <strong>S&eacute;rie:</strong> S&eacute;rie a qual a nota correspondente foi emitida<br />
        <strong>Cliente:</strong> Pessoa J&uacute;ridica a qual a nota foi emitida<br />
        <strong>ISSQN:</strong> Valor ref. ao Imposto Sobre Servi&ccedil;os de Qualquer Naturreza<br />
        <strong>IRPJ:</strong>  Valor ref. ao Imposto de Renda Pessoa Jur&iacute;dica<br />
        <strong>COFINS:</strong>  Valor ref. a Contribui&ccedil;&atilde;o para Financiamento da Seguridade Social<br />
        <strong>CSS:</strong>  Valor ref. a Contribui&ccedil;&atilde;o Social Sobre o Lucro Liquido<br />
        <strong>IRRF:</strong> Valor ref. ao Imposto de Renda Retido na Fonte<br />
        <strong>IRRF AC:</strong>  Valor ref. ao Imposto de Renda Retido na Fonte acumulado<br />
        <strong>Reducao AC:</strong> Redu&ccedil;&atilde;o acumulada<br />
        <strong>Total de impostos cliente:</strong> Valor ref. ao total de impostos do cliente<br />
        <strong>Total Servi&ccedil;o:</strong> Valor total dos servi&ccedil;os<br />
        <strong>Total NF:</strong> Total da NF<br />
        <strong>Situa&ccedil;&atilde;o:</strong> Em edi&ccedil;&atilde;o / N&atilde;o Emitida / Emitida / Cancelada<br />
      </p>
  <hr /><br />
		  <b>Regras de neg&oacute;cios</b><br />
		  <br />
          Este m&oacute;dulo se caracteriza por regras simples, possuindo no momento direitos apenas de visualiza&ccedil;&atilde;o para o usu&aacute;rio que possuir tal direito.<br />
          <br />
          <br /><hr /><br />
		  <b>Features</b><br />
		  <br />
          A fun&ccedil;&atilde;o basica deste modulo &eacute; a de Pesquisar as NF's emitidas, abrindo por padr&atilde;o o m&ecirc;s corrente, e podendo ser utilizado a pesquisa por NF, modelo, cliente, per&iacute;odo de emiss&atilde;o e situa&ccedil;&atilde;o.Al&eacute;m das fun&ccedil;&atilde;o  b&aacute;sica de pesquisa existe a  features abaixo: <br />
          <br />
          <b>1. &quot;menu combo</b><strong>&quot;</strong>.<br />
		  <ul>
			<li>Imprimir: permite a impress&atilde;o da grade pesquisada.</li>
		  </ul>
          
          </td>
  </tr>

  <tr><td height="40" colspan="2"></td></tr>	
  <tr>
    <td width="20" valign="top" bgcolor="#F9F9F9"></td>
    <td valign="top" style="padding-left:10px;">
		  <div style=" width:90%; height:130px; background-color:#F9F9F9;padding-top:10px; padding-left:20px; border:1px dotted #CCCCCC;">		  
		  <b>Informações sobre o documento</b><br />
		  <ul>
			<li>Sistema: VirtualBOSS</li>
			<li>Aplicação: modulo_FIN_NFREPORT</li>
			<li>Copyright: <b>Grupo PROEVENTO</b> - T E C H N O L O G I E S</li>
		  </ul>
          </div>
    </td>
  </tr>

  <tr><td height="40" colspan="2"></td></tr>	
</table>
</body>
</html>