<html>
<head>
<title>KernelPS - Revision History</title>
</head>
<style type="text/css">
 body {
  font-family:Arial, Helvetica, sans-serif;
  size:9px;
  line-height:20px;
 }
 li {
   font-family:Arial, Helvetica, sans-serif;
   size:9px;
 }
</style>
<body>

<table width="100%" border="0" cellpadding="5" cellspacing="0">
  <tr>
    <td align="center" bgcolor="#264b99">
	  <font face="verdana,arial" size="6" color="#FFFFFF"><b>VirtualBOSS</b></font><br>
      <b><font face="verdana,arial" size="4" color="#FFFFFF">Revision History - General</font></b>
	</td>
  </tr>
</table>

<p>
<small>Copyright ©<span style="font-size: 12px"><a href="http://www.proevento.com.br" target="_blank" style="text-decoration:none; size:9px;">
PROEVENTO - T E C N O L O G I A</a></span><br>
All rights reserved.<br></small></p>

<h3>v12 </h3>

<ul>
  
  <li>...</li>
</ul>

<h3>v11 </h3>

<ul>
  
  <li>...</li>
</ul>

<h3>v10 </h3>
<ul>
	
  <li>...</li>
  </ul>
	
<h3>&nbsp;</h3>
<table width="100%" border="0" cellpadding="5" cellspacing="0">
  <tr>
    <td align="center" bgcolor="#264b99">
	  <font face="verdana,arial" size="6" color="#FFFFFF"><b>VirtualBOSS</b></font><br>
      <b><font face="verdana,arial" size="4" color="#FFFFFF">Revision History - Developers</font></b>
	</td>
  </tr>
</table>

<h3>v12.11 </h3>

<ul>
  <li>Login permanente (sandbox) - enquanto a sess&atilde;o estiver ativa permanece logado ao voltar a p&aacute;gina</li>
  <li>Coloca&ccedil;&atilde;o do novo <strong>Component Check</strong>&nbsp;v0.41 - Kevin Kempfer </li>
  <li>Permiti que as anota&ccedil;&otilde;es (post-its) sejam p&uacute;blicos</li>
  <li> Ajustes de inconformidades.</li>
  <li>Modelagem da estrutura de help por m&oacute;dulos e coloca&ccedil;&atilde;o do novo m&oacute;dulo de help (leitor unificado dos helps de cada m&oacute;dulo) </li>
</ul>
<h3>v8.1 a 12.10 </h3>
<ul>
  <li>Nova interface - Menu lateral: Collapse group e frame</li>
  <li> Painel inicial, com ponto, agenda e mensagens.</li>
  <li>Mudan&ccedil;a de BD para MySQL5 </li>
  <li>Padroniza&ccedil;&atilde;o dos m&oacute;dulos e estrutura de APP - conceito: Filtro, Grade e DIALOGs </li>
  <li>Implementa&ccedil;&atilde;o AJAX - abertura de DIALOGS - permite configura&ccedil;&atilde;o de formato (Dialog IN, OUT ou POPUP)</li>
  <li>Reestrutura&ccedil;&atilde;o CSS para constru&ccedil;&atilde;o dos m&oacute;dulos (framework redefinido a partir de DIVs)   </li>
  <li>Gera&ccedil;&atilde;o de arquivo (excel/word) no m&oacute;dulo de Relat&oacute;rios ASLW</li>
  <li>Coloca&ccedil;&atilde;o DOCTYPE (desde 2010, propagado agora 
  para os demais sistemas)
    <ul>
      <li>&lt; ! DOCTYPE HTML PUBLIC " -//W3C//DTD HTML 4.01 Frameset//EN "  " http://www.w3.org/TR/html4/frameset.dtd " &gt; </li>
    </ul>
  </li>
  <li>Ajuste no CSS do componente tablesort para que n&atilde;o
  conflito com o CSS padr&atilde;o.</li>
  <li>Cria&ccedil;&atilde;o de novas classes CSS para facilitar a 
    manipula&ccedil;&atilde;o de layout dos sistemas 
    nos arquivos de
  modulo do kernel</li>
  <li>Checagem de componentes ativos e System INFO implementada (a parte de componentes demonstra-se inst&aacute;vel e ser&aacute; substitu&iacute;da) <br>
  </li>
  <li> Otimiza&ccedil;&atilde;o do CSS default (default.css)</li>
  <li>Modelagem financeira: COTABANCO, TITULOS, LCTO EM CONTA e ORDIN&Agrave;RIOS, TRANFS </li>
  <li>Implementa&ccedil;&atilde;o da AJUSTA SALDO </li>
  <li> Ajustes nas telas que usam as rotinas AJAX que n&atilde;o
    estavam no padr&atilde;o estabelecido</li>
  <li>Implementa&ccedil;&atilde;o de anota&ccedil;&otilde;es - tipo post-it </li>
  <li>Box de aniversariantes do m&ecirc;s (anivers&aacute;rios de usu&aacute;rios colegas, ou seja, que est&atilde;o ligados a mesma entidade que o usuário logado) </li>
  <li>Tentando fazer com que o cache dos navegadores n&atilde;o aconte&ccedil;a, o bot&atilde;o de pesquisa que &eacute; acionado depois de qualquer execu&ccedil;&atilde;o de dialog, adiciona um parâmetro com valor aleat&oacute;rio para tentar fazer com que o navegador n&atilde;o devolva a mesma p&aacute;gina anterior com dados desatualizados </li>
  <li></li>
</ul>

<h3>v6.8 a 7.9</h3>

<ul>
    <li>Modifica&ccedil;&atilde;o da interface para o padr&atilde;o athCSM3<br>
  </li>
  <li>Menu principal superior e m&oacute;dulos abertos em iframe</li>
  <li>Mudan&ccedil;a de BD para MySQL4 </li>
  <li>Ajuste do m&oacute;dulo DBExplorer - para operar com MySQL (AcessHelp.net-ASP)</li>
  <li>Sistema unificado para multiplos clientes (um DB por cliente) </li>
  <li>Sistema de direitos por m&oacute;dulo</li>
  <li>Rotinas para montagem de BOX DIALOGS (athBeginDialog, etc...) </li>
  <li>Homologa&ccedil;&atilde;o da main.asp com uso do TABLESORT </li>
  <li>Padroniza&ccedil;&atilde;o dos m&eacute;todos de sa&iacute;da das Dialogs (a&ccedil;&atilde;o do bot&atilde;o de filtro) </li>
  <li>Modelagem e m&oacute;dulo de contratos introduzidos </li>
  <li>Modelagem e m&oacute;dulos de biblioteca/acervos </li>
  <li>Estabelecida regra de montagem dos m&oacute;dulos e sua estrutura basica definida (filtro,  grade e dialog) </li>
</ul>

<h3>v5.11 a 6.7</h3>
<ul>
  <li> </li>
  Sistema BSCONTROL desativado, novo sistema montado a partir de modelagens de sistemas menores j&aacute; desenvolvidos na empresa 
  <ul>
    <li>Controle de ponto - athPONTO</li>
    <li>Controle de chamados - IssueManager</li>
    <li>Controle de conte&uacute;do - athCSM1</li>
    <li>Relat&oacute;rios ASLW - athcsm1<br>
    </li>
  </ul>
    
  <li>Modelagem b&aacute;sica mantida: CONSULTOR, BS, CLIENTE e SETOR</li>
  
  <li>BS (boletim de servi&ccedil;o) representava a tarefa, agora passa a representar algo maior (atividade). Nesta modelagem teremos BS -&gt; BS_TASK</li>
  <li>Defini&ccedil;&atilde;o de Equipe por BS</li>
  <li>Elimina&ccedil;&atilde;o do Metatraffic</li>
  <li>Elimina&ccedil;&atilde;o da estrutura de conte&uacute;do (padr&atilde;o athCSM)  </li>
  <li>Adicionado o m&oacute;dulo DBExplorer - baseado no AcessHelp.net</li>
  <li>Modelagem e m&oacute;dulo de Processos introduzido</li>
  <li>Modelagem e m&oacute;dulo de Invent&aacute;rio introduzido</li>
  <li>Modelagem e m&oacute;dulo de Accounts introduzido (gest&atilde;o de user, urls, senhas e paneis)</li>
  <li> </li>
</ul>

<h3 align="left"><font color="#264B99">v5.10</font></h3>
<ul><li>
    <p align="left"><font color="#264B99">Primeira vers&atilde;o publicada com nome de <strong>BSControl</strong> (Empresas beta-testers - Acessora Contabil e Ag&ecirc;ncia de Publicidade)</font> </p>
  </li>
</ul>
<h3>v3.1 a 5.1</h3>
<ul>
  <li>Retomanda do projeto </li>
  <li>Novo paradigma - controle de tarefas n&atilde;o automatizado, mas gerenci&aacute;vel com defini&ccedil;&atilde;o de planejamento de tarefas. Sistema de refer&ecirc;ncia MS Project. vers&atilde;o desenvolvida e prototipada em desktop - primeiros rascunhos para desenvolvimento web.</li>
  
  <li>Modelagem de Tarefas com possibilidade de feedbak (multiplas respostas) de cada tarefa</li>
  <li>Controle e cadastro de usu&aacute;rios simplificado</li>
  <li>Escolha do DB (Acess) e da linguagem de script (VBScript/ASP)</li>
  </ul>
<h3>v1.9  a 2.12  </h3>
<ul>
   
  <li>try icon - login/logout (valida a entrada de uma app com comunica&ccedil;&atilde;o athDDE)</li>
  <li>verifica&ccedil;&atilde;o de vers&atilde;o (AcCopy)</li>
  <li>    executa fun&ccedil;&otilde;es autom&aacute;ticas necess&aacute;rias</li>
  <li> registro de tarefas (semelhante ao vboss antigo)</li>
  <li> possibilidade de agendamento (atendimento) r&aacute;pido</li>
  <li> marcar/desmarcar reuni&atilde;o rapidamente</li>
  <li> mecanismo de comunica&ccedil;&atilde;o entre usu&aacute;rios                             <br>
  </li>
</ul>
<h3>v0.9 a 1.8 (01/09/2000) </h3>
<ul>
   
  <li>Vers&atilde;o prot&oacute;tipo - controle de tarefas autom&aacute;tico, desktop-windows. Identificando programas abertos com arquivos abertos de determinados projetos cadastrados, sabe-se o tempo dispendido em cada projeto, m&oacute;dulo ou arquivo do sistema. Desenvolvido para controle de horas dispendidas em projetos exclusivamente desktop. Vers&atilde;o em testes durante o desenvolvimento do sistema ATHEMIS MD (codinome Acapulco) para distribui&ccedil;&atilde;o e log&iacute;stica</li>
</ul>
<p>&nbsp;</p>
<table width="100%" border="0" cellpadding="5" cellspacing="0">
  <tr>
    <td align="center" bgcolor="#264b99">
	  <font face="verdana,arial" size="6" color="#FFFFFF"><b>VirtualBOSS</b></font><br>
      <b><font face="verdana,arial" size="4" color="#FFFFFF">Previsões para as próximas versões</font></b>
	</td>
  </tr>
</table>
<p><br>
  Nosso objetivo aqui é descrever as funcionalidades
nas quais estamos trabalhando para as próximas vers&otilde;es 
do  VirtualBOSS, sistema que hoje abrange  uma s&eacute;rie de funcionalidades que o tornam extremamente flex&iacute;vel a v&aacute;rios tipos de aplica&ccedil;&atilde;o e uso que v&atilde;o desde opera&ccedil;&otilde;es  ERP, CRM, Controle de Projetos at&eacute; HelpDesk.<br>
<br>
Não entraremos em detalhes para manter sigilo sobre os novos lançamentos.</p>
<h3>Funcionalidades</h3>

<ul>
  <li>Encapsulamento do n&uacute;cleo e demais rotinas em classes</li>
  <li>Implementa&ccedil;&atilde;o de NFe de servi&ccedil;o para Pref. SP /  NFe de Produtos (uso em SP e SP) </li>
  <li>Novo sistema de pedidos/produtos e servi&ccedil;os com implementa&ccedil;&atilde;o extra de Painel (como o de chamados) para solicita&ccedil;&atilde;o/pedidos direto de clientes e visualiza&ccedil;&atilde;o do seus pagamentos, reemiss&atilde;o de boletos, etc) </li>
  <li>Complemento aos m&oacute;dulos de Biblioteca - controle de empr&eacute;stimos e devoluções</li>
  <li>Defini&ccedil;&atilde;o de protocolo para disponibiliza&ccedil;&atilde;o de dados a sistemas de terceiros</li>
  <li>Ajuste finalizando os m&oacute;dulos de gest&atilde;o de Cargos/Cargos e Compet&ecirc;ndias) </li>
</ul>

<h3>Otimiza&ccedil;&otilde;es</h3>

<ul>
  <li>Convers&atilde;o de rotinas de script para storedprocedures </li>
  <li>Estudo de mudan&ccedil;a de DB (MYSQL5 to PostgreSQL) / uso de replica&ccedil;&atilde;o de dados</li>
  <li>Integra&ccedil;&atilde;o com API Google e possibilidade sub-m&oacute;dulos ligados ao Facebook</li>
  </ul>

<h3>Help</h3>

<ul>
  <li>Manual geral e b&aacute;sico dos m&oacute;dulos do sistema</li>
  <li>Manual de desenvolvimento, regras e frameworks  para novos desenvolvedores <br>
    <br>
  </li>
</ul>

<hr>


<p>  
Equipe de desenvolvimento,<br>
Alessander P. Oliveira - Diretor de Projeto/Cria&ccedil;&atilde;o</small><br>
<b>PROEVENTO</b> - T E C N O L O G I A</p>
<hr>
</body>
</html>